In [1]:
import pandas as pd

In [2]:
data = pd.read_excel("strategy_results_train.xlsx")

In [3]:
data.head()

,id,label,0,1,2,3,4,5,6,7,8
0,SHSE.600085_201501,0,2014-12-30,20.900000,22.090000,20.799999,22.049999,25457468.0,21.291999,21.369,21.636000
1,SHSE.600085_201502,1,2015-01-30,22.990000,23.190001,22.510000,22.580000,7880595.0,23.320000,23.386,23.590000
2,SHSE.600085_201503,1,2015-02-27,22.520000,22.670000,22.400000,22.540001,9263796.0,22.442000,22.106,22.165333
3,SHSE.600085_201504,1,2015-03-30,26.219999,26.440001,25.820000,26.230000,16125626.0,26.378000,25.148,24.380667
4,SHSE.600085_201505,1,2015-04-29,32.580002,33.639999,32.279999,33.180000,13959795.0,32.888000,32.902,32.436000

In [4]:
data2 = pd.concat( [data.iloc[:, 1], data.iloc[:, 8:]], axis=1)

In [5]:
data2.head()

   label          6       7          8
0      0  21.291999  21.369  21.636000
1      1  23.320000  23.386  23.590000
2      1  22.442000  22.106  22.165333
3      1  26.378000  25.148  24.380667
4      1  32.888000  32.902  32.436000

In [6]:
data2.isnull().any()

label    False
6         True
7         True
8         True
dtype: bool

In [7]:
data2 = data2.dropna(axis = 0)
data2.isnull().any()

label    False
6        False
7        False
8        False
dtype: bool

In [8]:
y = data2["label"]
y

0        0
1        1
2        1
3        1
4        1
        ..
31942    1
31943    0
31944    0
31945    0
31946    0
Name: label, Length: 31877, dtype: int64

In [9]:
X = data2.iloc[:, 1:]

In [10]:
X

               6          7          8
0      21.291999  21.369000  21.636000
1      23.320000  23.386000  23.590000
2      22.442000  22.106000  22.165333
3      26.378000  25.148000  24.380667
4      32.888000  32.902000  32.436000
...          ...        ...        ...
31942  58.442000  60.356001  60.682667
31943  56.290000  55.929000  56.114000
31944  55.034000  53.455999  52.943999
31945  45.882000  47.193000  49.858000
31946  49.150001  50.371001  51.181334

[31877 rows x 3 columns]

In [11]:
X = X.dropna(axis = 0)

In [12]:
X.isnull().any()

6    False
7    False
8    False
dtype: bool

In [13]:
X.shape

(31877, 3)

In [14]:
from sklearn.ensemble import RandomForestClassifier
clf = RandomForestClassifier()
clf.fit(X, y)

C:\Users\Eating\Anaconda3\lib\site-packages\sklearn\ensemble\forest.py:245: FutureWarning: The default value of n_estimators will change from 10 in version 0.20 to 100 in 0.22.
  "10 in version 0.20 to 100 in 0.22.", FutureWarning)

RandomForestClassifier(bootstrap=True, class_weight=None, criterion='gini',
                       max_depth=None, max_features='auto', max_leaf_nodes=None,
                       min_impurity_decrease=0.0, min_impurity_split=None,
                       min_samples_leaf=1, min_samples_split=2,
                       min_weight_fraction_leaf=0.0, n_estimators=10,
                       n_jobs=None, oob_score=False, random_state=None,
                       verbose=0, warm_start=False)

In [15]:
testdata = pd.read_excel("sampleSubmission.xlsx")

In [16]:
testdata = testdata.fillna(0)
testdata.isnull().any()

id       False
label    False
6        False
7        False
8        False
dtype: bool

In [17]:
testdata.iloc[:, 2:]

               6          7          8
0      27.258000  27.573000  28.198000
1      26.624000  26.698000  26.724667
2      28.890000  28.863000  28.408667
3      29.532000  30.037000  30.157333
4      31.514000  32.125000  32.192000
...          ...        ...        ...
11358  86.210001  86.955000  86.357333
11359  77.136000  80.214001  82.662001
11360  70.966000  71.855001  72.971334
11361  82.976001  79.619000  77.530667
11362  81.462000  82.899000  84.118667

[11363 rows x 3 columns]

In [18]:
result = clf.predict(testdata.iloc[:, 2:])

In [19]:
pd.DataFrame(result).to_excel("prediction.xlsx", index=False)